Public Class C画面制御入退室管理
    Inherits C画面制御

    '#####################################################################################
    '型
    '#####################################################################################

    '#####################################################################################
    'メンバ変数
    '#####################################################################################
    '子画面定義
    Public Shared ログイン As C子画面 = New C子画面("ログイン")

    '#####################################################################################
    'プロパティー
    '#####################################################################################

    '#####################################################################################
    'イベント
    '#####################################################################################

    '#####################################################################################
    'イベントハンドラ
    '#####################################################################################

    '#####################################################################################
    'プロシージャ
    '#####################################################################################
    Public Overrides Sub 画面初期化処理()
        If CUtil.設定関連.設定文字列読込("app.パスワード") = "" Then
            CUtil.設定関連.設定文字列書込("app.パスワード", Crypto.Key.Encrypt(C画面制御.パスフレーズ, "0000"))
        End If

        'DB関連初期処理
        gdp = New CSdp
        CUsrctl.gDp = gdp
        With CUsrctl.gDp
            .ホスト名 = CUtil.設定関連.設定文字列読込("dp.ホスト名")
            .データベース名 = CUtil.設定関連.設定文字列読込("dp.データベース名")
            .ユーザ名 = CUtil.設定関連.設定文字列読込("dp.ユーザー名")
            Dim 暗号化されたパスワード As String = CUtil.設定関連.設定文字列読込("dp.パスワード")
            .パスワード = Crypto.Key.Decrypt(C画面制御.パスフレーズ, 暗号化されたパスワード)
            .再接続試行回数 = CInt(CUtil.設定関連.設定文字列読込("dp.再接続回数", "3"))
        End With

        初期画面ID = ログイン

        If CUtil.設定関連.設定Boolean値読込("RFID.有効") Then
            Try
                'リーダライタ初期設定
                C入退管理Ex.gリーダライタ = New CHRW_DSU01
            Catch ex As Exception
                CMsg.gMsg_エラー("リーダライタの初期化に失敗しました。リーダライタが接続され、電源が入っているか確認の上、起動し直してください。")
                End
            End Try
        End If
        CSql.デフォルトあいまい検索モード = CUtil.設定関連.設定文字列読込("CSql.あいまい検索モード")
    End Sub

    Public Overrides Function 子フォーム生成(ByVal 子画面 As C子画面) As Form

        If 子画面 Is C画面制御入退室管理.ログイン Then
            Return New Frm0000ログイン画面


        End If

        Return Nothing
    End Function
End Class
