Imports System.Data.SqlClient
Imports System.Data.Common

''' <summary>
''' 「.NET Framework Data Provider for SQL Server」用クラス
''' </summary>
''' <remarks></remarks>
Public Class CSdp
    Inherits Cdp

    '#####################################################################################
    '型
    '#####################################################################################

    '#####################################################################################
    'メンバ変数
    '#####################################################################################

    '#####################################################################################
    'プロパティー
    '#####################################################################################

    '#####################################################################################
    'イベント
    '#####################################################################################

    '#####################################################################################
    'イベントハンドラ
    '#####################################################################################

    '#####################################################################################
    'プロシージャ
    '#####################################################################################
    Protected Overrides Function 新規接続() As DbConnection
        Return New SqlConnection
    End Function
    Public Overrides Function AddWithValue(ByVal コマンド As DbCommand, ByVal パラメータ名 As String, ByVal 値 As Object) As DbParameter
        Return CType(コマンド, SqlCommand).Parameters.AddWithValue(パラメータ名, 値)
    End Function

    Public Overrides Function アダプタを生成して返す(ByVal sql As String) As DbDataAdapter
        Return New SqlDataAdapter(sql, CType(gdb接続, SqlConnection))
    End Function

End Class
