Public Class C入退管理Ex
    Inherits 入退共通.C入退管理
    '#####################################################################################
    '型
    '#####################################################################################

    '#####################################################################################
    'メンバ変数
    '#####################################################################################
    Public Shared gリーダライタ As CHRW_DSU01

    ''エラーログクラス
    Public Shared _Log As CLog

    '#####################################################################################
    'プロパティー
    '#####################################################################################

    '#####################################################################################
    'イベント
    '#####################################################################################

    '#####################################################################################
    'イベントハンドラ
    '#####################################################################################

    '#####################################################################################
    'プロシージャ
    '#####################################################################################
    Private Sub New()
    End Sub

    ''' <summary>
    ''' ログファイルの設定を行う
    ''' </summary>
    ''' <remarks></remarks>
    Public Shared Sub ログファイル設定()
        'ログ設定
        _Log = New CLog
        With _Log
            'ロケーションをEXEフォルダ配下のLogに設定
            .CustomLocation = "c:\" 'Me._s.APL_ログ保存フォルダ
            '日別でファイルを作成するように設定
            .LogFileCreationSchedule = Logging.LogFileCreationScheduleOption.Daily
            '１ギガバイトを必ず残すように設定
            .ReserveDiskSpace = 1024 * 1024 * 1024 * 1
            '１ギガまで可能とする
            .MaxFileSize = 1024 * 1024 * 1024 * 1
            'ファイルが満杯の場合、以降のログは廃棄します
            .DiskSpaceExhaustedBehavior = Logging.DiskSpaceExhaustedOption.DiscardMessages
            'ベースファイル名
            .BaseFileName = "入退室管理" ' Me._s.APL_ログファイルベース名
            'ログの内容をリストに表示します
            'AddHandler .WritedLine, AddressOf メインログ表示
        End With
    End Sub

End Class
