'Public Class C画面制御入退室管理
Public Class C画面制御オーダー別
    Inherits C画面制御

    '#####################################################################################
    '型
    '#####################################################################################

    '#####################################################################################
    'メンバ変数
    '#####################################################################################
    '子画面定義
    Public Shared 醗酵メインメニュー As C子画面 = New C子画面("醗酵メインメニュー")
    Public Shared 冷却メインメニュー As C子画面 = New C子画面("冷却メインメニュー")
    '=========
    '醗酵PLC側
    '=========
    '----------
    '入出庫設定
    '----------
    Public Shared 入庫設定 As C子画面 = New C子画面("入庫設定")
    Public Shared 醗酵完了出庫設定 As C子画面 = New C子画面("醗酵完了出庫設定")
    Public Shared 醗酵棚指定出庫設定 As C子画面 = New C子画面("醗酵棚指定出庫設定")
    '------
    '問合せ
    '------
    Public Shared マスター設定 As C子画面 = New C子画面("マスター設定")
    Public Shared 入庫棚順設定設定 As C子画面 = New C子画面("入庫棚順設定")
    Public Shared 醗酵棚問合せメンテナンス As C子画面 = New C子画面("醗酵棚問合せ・メンテナンス")
    Public Shared 醗酵在庫問合せ As C子画面 = New C子画面("醗酵在庫問合せ")
    Public Shared 醗酵空棚問合せ As C子画面 = New C子画面("醗酵空棚問合せ")
    '----
    '管理
    '----
    Public Shared 発酵設備状況 As C子画面 = New C子画面("設備状況")
    Public Shared 生産実績 As C子画面 = New C子画面("生産実績")
    Public Shared 温度実績 As C子画面 = New C子画面("温度実績")
    Public Shared 作業履歴 As C子画面 = New C子画面("作業履歴")
    '----------
    'その他
    '----------
    Public Shared ジャーナル照会 As C子画面 = New C子画面("ジャーナル照会")
    Public Shared 帳票メニュー As C子画面 = New C子画面("帳票メニュー")

    '=========
    '冷却PLC側
    '=========
    '----------
    '入出庫設定
    '----------
    Public Shared 冷却完了出庫設定 As C子画面 = New C子画面("冷却完了出庫設定")
    Public Shared 冷却棚指定出庫設定 As C子画面 = New C子画面("冷却棚指定出庫設定")
    '------
    '問合せ
    '------
    Public Shared 冷却棚問合せメンテナンス As C子画面 = New C子画面("冷却棚問合せ・メンテナンス")
    Public Shared 冷却在庫問合せ As C子画面 = New C子画面("冷却在庫問合せ")
    Public Shared 冷却空棚問合せ As C子画面 = New C子画面("冷却空棚問合せ")
    '----
    '管理
    '----
    Public Shared 冷却設備状況 As C子画面 = New C子画面("冷却設備状況")

    '#####################################################################################
    'プロパティー
    '#####################################################################################

    '#####################################################################################
    'イベント
    '#####################################################################################

    '#####################################################################################
    'イベントハンドラ
    '#####################################################################################

    '#####################################################################################
    'プロシージャ
    '#####################################################################################
    Public Overrides Sub 画面初期化処理()
        'DB関連初期処理
        gdp = New CSdp
        CUsrctl.gDp = gdp
        With CUsrctl.gDp
            .ホスト名 = CUtil.設定関連.設定文字列読込("dp.ホスト名")
            .データベース名 = CUtil.設定関連.設定文字列読込("dp.データベース名")
            .ユーザ名 = CUtil.設定関連.設定文字列読込("dp.ユーザー名")
            Dim 暗号化されたパスワード As String = CUtil.設定関連.設定文字列読込("dp.パスワード")
            .パスワード = Crypto.Key.Decrypt(C画面制御.パスフレーズ, 暗号化されたパスワード)
            .再接続試行回数 = CInt(CUtil.設定関連.設定文字列読込("dp.再接続回数", "3"))
        End With

        初期画面ID = 醗酵メインメニュー

        CSql.デフォルトあいまい検索モード = CUtil.設定関連.設定文字列読込("CSql.あいまい検索モード")
    End Sub

    Public Overrides Function 子フォーム生成(ByVal 子画面 As C子画面) As Form


        If 子画面 Is C画面制御オーダー別.醗酵メインメニュー Then
            Return New Frm00001_醗酵側メインメニュー

        ElseIf 子画面 Is C画面制御オーダー別.冷却メインメニュー Then
            Return New Frm00002_冷却側メインメニュー

            '------------
            '醗酵 入出庫設定
            '------------
        ElseIf 子画面 Is C画面制御オーダー別.入庫設定 Then
            Return New Frm01001_入庫設定

        ElseIf 子画面 Is C画面制御オーダー別.醗酵完了出庫設定 Then
            Return New Frm01004_醗酵完了出庫設定

        ElseIf 子画面 Is C画面制御オーダー別.醗酵棚指定出庫設定 Then
            Return New Frm01005_醗酵棚指定出庫設定

            '------------
            '醗酵 問合せ
            '------------
        ElseIf 子画面 Is C画面制御オーダー別.マスター設定 Then
            Return New Frm01011_醗酵マスター設定

        ElseIf 子画面 Is C画面制御オーダー別.入庫棚順設定設定 Then
            Return New Frm01012_醗酵入庫棚順設定

        ElseIf 子画面 Is C画面制御オーダー別.醗酵棚問合せメンテナンス Then
            Return New Frm01013_醗酵棚問合せメンテナンス

        ElseIf 子画面 Is C画面制御オーダー別.醗酵在庫問合せ Then
            Return New Frm01014_醗酵在庫問合せ

        ElseIf 子画面 Is C画面制御オーダー別.醗酵空棚問合せ Then
            Return New Frm01015_醗酵空棚問合せ

            '------------
            '醗酵 管理
            '------------
        ElseIf 子画面 Is C画面制御オーダー別.発酵設備状況 Then
            Return New Frm00003_醗酵側設備状況

        ElseIf 子画面 Is C画面制御オーダー別.生産実績 Then
            Return New Frm01022_生産実績問合せ

        ElseIf 子画面 Is C画面制御オーダー別.温度実績 Then
            Return New Frm01023_温度実績問合せ

        ElseIf 子画面 Is C画面制御オーダー別.作業履歴 Then
            Return New Frm01024_作業履歴照会

        ElseIf 子画面 Is C画面制御オーダー別.ジャーナル照会 Then
            Return New Frm01041_ジャーナル照会

        ElseIf 子画面 Is C画面制御オーダー別.帳票メニュー Then
            Return New Frm01041_帳票出力

            '------------
            '冷却 入出庫設定
            '------------
        ElseIf 子画面 Is C画面制御オーダー別.冷却完了出庫設定 Then
            Return New Frm02001_冷却完了出庫設定

        ElseIf 子画面 Is C画面制御オーダー別.冷却棚指定出庫設定 Then
            Return New Frm02002_冷却棚指定出庫設定

            '------------
            '冷却 問合せ
            '------------
        ElseIf 子画面 Is C画面制御オーダー別.冷却棚問合せメンテナンス Then
            Return New Frm02011_冷却棚問合せメンテナンス

        ElseIf 子画面 Is C画面制御オーダー別.冷却在庫問合せ Then
            Return New Frm02012_冷却在庫問合せ

        ElseIf 子画面 Is C画面制御オーダー別.冷却空棚問合せ Then
            Return New Frm02013_冷却空棚問合せ

            '------------
            '冷却 管理
            '------------
        ElseIf 子画面 Is C画面制御オーダー別.冷却設備状況 Then
            Return New Frm00003_冷却側設備状況

        End If

        Return Nothing
    End Function
End Class
